<img src="img/Marca-ITBA-Color-ALTA.png" width="250">

# Programación para el Análisis de Datos

## Clase 3 parte 2 - ejercitación

In [1]:
import numpy as np
import pandas as pd

### Ejercicio 1

A partir de la siguiente `Serie` de datos, reemplazar las mayusculas por minusculas

In [2]:
s = pd.Series(['X', 'Y', 'Z', 'Aaba', 'Baca', np.nan, 'CABA', None, 'bird', 'horse', 'dog'])

In [3]:
### Tu solución aquí:
s.str.lower()

0         x
1         y
2         z
3      aaba
4      baca
5       NaN
6      caba
7      None
8      bird
9     horse
10      dog
dtype: object

### Ejercicio 2

Reemplazar lo nulos (`None` y `np.nan`) de la serie por `'nulo'`

In [4]:
s = pd.Series(['X', 'Y', 'Z', 'Aaba', 'Baca', np.nan, 'CABA', None, 'bird', 'horse', 'dog'])

In [7]:
### Tu solución aquí:
s = s.replace({np.nan: 'nulo', None: 'nulo'})

s

0         X
1         Y
2         Z
3      Aaba
4      Baca
5      nulo
6      CABA
7      nulo
8      bird
9     horse
10      dog
dtype: object

### Ejercicio 3

Cambiar el formato de todas las columnas numéricas para que se expresen con 2 posiciones decimales.

Ej: `0.1234`  $\rightarrow$ `0.12`

In [8]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'skfsalf', 'sdfslew', 'safsdf'],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [123.485, 233.3312, 22.5000, 2566.5520, 23.158070],
    'unit_price': [1.999, 23.3333, 0.225000, 15.6875, 0.0051]})
df

  company_code date_of_sale   sale_amount  unit_price
0         Abcd    12/05/2002    123.48500      1.9990
1         EFGF    16/02/1999    233.33120     23.3333
2      skfsalf    25/09/1998     22.50000      0.2250
3      sdfslew    12/02/2022   2566.55200     15.6875
4       safsdf    15/09/1997     23.15807      0.0051

In [9]:
### Completa con tu código aquí
df = df.round(2)

df
###

  company_code date_of_sale   sale_amount  unit_price
0         Abcd    12/05/2002       123.48        2.00
1         EFGF    16/02/1999       233.33       23.33
2      skfsalf    25/09/1998        22.50        0.22
3      sdfslew    12/02/2022      2566.55       15.69
4       safsdf    15/09/1997        23.16        0.01

### Ejercicio 4

Obtener el largo del texto que aparece en la columna `texto` y almacenarlo en la columna `text_len`.

In [10]:
df = pd.DataFrame({
    'texto': ["Quisque",
            "Mauris",
            "Vest4bulum,",
            "A 231",
            "lñgula"]
})

In [16]:
### Completa con tu código aquí
df.head()

df['text_len'] = df['texto'].map(lambda x: len(x))

df
###

         texto  text_len
0      Quisque         7
1       Mauris         6
2  Vest4bulum,        11
3        A 231         5
4       lñgula         6